OpenQBMM-OpenFOAM-v2306/validation/polydisperseBubbleFoam/Diaz/Diaz_1_2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     polydisperseBubbleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      100;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.05;

maxDeltaT       1.0e-3;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (libfieldFunctionObjects);
        writeControl    writeTime;
        timeStart       50;
        fields
        (
            U.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            d.air
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
    pProbes
    {
        type        probes;
        libs        (libsampling);
        startTime   0;
        probeLocations
        (
            (0  0.038   0.002)
            (0  0.213   0.002)
            (0  0.413   0.002)
        );

        fields
        (
            p
        );
    }
}


// ************************************************************************* //
